Here are 50 practical questions on pandas:





Data Transformation

1. How to melt a DataFrame?
2. How to pivot a DataFrame?
3. How to stack a DataFrame?
4. How to unstack a DataFrame?
5. How to transpose a DataFrame?

Data Selection

1. How to select rows based on a condition?
2. How to select columns based on a condition?
3. How to select rows and columns based on conditions?
4. How to use label-based selection?
5. How to use position-based selection?



Data Visualization

1. How to create a line plot?
2. How to create a bar plot?
3. How to create a histogram?
4. How to create a scatter plot?
5. How to create a box plot?

Advanced Topics

1. How to use the apply function?
2. How to use the map function?
3. How to use the lambda function?
4. How to use the groupby-apply function?
5. How to use the pivot_table function?

Let me know if you want me to help with any specific question!

# Data Manipulation

## 1. How to create a new DataFrame from a dictionary?

In [228]:
import pandas as pd

In [229]:
employee_info={

    'Emp_id':[1,2,3,4,5,6,7,8,9,10,11],
    'Name':['anisha','sakshi','poonam','omkar','ganesh','samiksha','devanand','vishnu','govind',"gayatri",'shamal'],
    'Age':[21,20,19,20,21,22,19,18,23,20,19,],
    'Location':['parbhani','nanded','parbhani','pune','aurangabad','mumbai','nashik','nanded','amravati','beed','nanded'],
    'Department_id':[102,104,103,101,101,103,105,103,102,101,104],
    'Department_name':["data science",'HR','production','devlopment','devlopment','production','marketing','production',"data science",'devlopment','HR'],
    'Salary':[52000,65600,95000,104440,98000,50000,45000,620000,104440,98000,50000,]

}

In [230]:
emp_df=pd.DataFrame(employee_info)

In [231]:
emp_df

    Emp_id      Name  Age    Location  Department_id Department_name  Salary
0        1    anisha   21    parbhani            102    data science   52000
1        2    sakshi   20      nanded            104              HR   65600
2        3    poonam   19    parbhani            103      production   95000
3        4     omkar   20        pune            101      devlopment  104440
4        5    ganesh   21  aurangabad            101      devlopment   98000
5        6  samiksha   22      mumbai            103      production   50000
6        7  devanand   19      nashik            105       marketing   45000
7        8    vishnu   18      nanded            103      production  620000
8        9    govind   23    amravati            102    data science  104440
9       10   gayatri   20        beed            101      devlopment   98000
10      11    shamal   19      nanded            104              HR   50000

## 2. How to select a specific column from a DataFrame?

In [232]:
emp_df[["Name","Age"]]

        Name  Age
0     anisha   21
1     sakshi   20
2     poonam   19
3      omkar   20
4     ganesh   21
5   samiksha   22
6   devanand   19
7     vishnu   18
8     govind   23
9    gayatri   20
10    shamal   19

## 3. How to filter rows based on a condition?

In [233]:
emp_df[emp_df["Age"]<=22]

    Emp_id      Name  Age    Location  Department_id Department_name  Salary
0        1    anisha   21    parbhani            102    data science   52000
1        2    sakshi   20      nanded            104              HR   65600
2        3    poonam   19    parbhani            103      production   95000
3        4     omkar   20        pune            101      devlopment  104440
4        5    ganesh   21  aurangabad            101      devlopment   98000
5        6  samiksha   22      mumbai            103      production   50000
6        7  devanand   19      nashik            105       marketing   45000
7        8    vishnu   18      nanded            103      production  620000
9       10   gayatri   20        beed            101      devlopment   98000
10      11    shamal   19      nanded            104              HR   50000

## 4. How to sort a DataFrame by a column?

In [234]:
emp_df.sort_values(by="Age",ascending=True)

    Emp_id      Name  Age    Location  Department_id Department_name  Salary
7        8    vishnu   18      nanded            103      production  620000
2        3    poonam   19    parbhani            103      production   95000
6        7  devanand   19      nashik            105       marketing   45000
10      11    shamal   19      nanded            104              HR   50000
3        4     omkar   20        pune            101      devlopment  104440
1        2    sakshi   20      nanded            104              HR   65600
9       10   gayatri   20        beed            101      devlopment   98000
0        1    anisha   21    parbhani            102    data science   52000
4        5    ganesh   21  aurangabad            101      devlopment   98000
5        6  samiksha   22      mumbai            103      production   50000
8        9    govind   23    amravati            102    data science  104440

## 5. How to group data by a column and apply a function?

In [235]:
# calculate category vise count of employees
emp_df.groupby("Department_name")["Salary"].count()

Department_name
HR              2
data science    2
devlopment      3
marketing       1
production      3
Name: Salary, dtype: int64

In [236]:
# calculate sum of salary by deaprtment
emp_df.groupby("Department_name")["Salary"].sum()

Department_name
HR              115600
data science    156440
devlopment      300440
marketing        45000
production      765000
Name: Salary, dtype: int64

In [237]:
# calculate min and max of salary by deaprtment
emp_df.groupby("Department_name")["Salary"].min()
emp_df.groupby("Department_name")["Salary"].max()

Department_name
HR               65600
data science    104440
devlopment      104440
marketing        45000
production      620000
Name: Salary, dtype: int64

In [238]:
# calculate avg of salary by deaprtment
emp_df.groupby("Department_name")["Salary"].mean()

Department_name
HR               57800.000000
data science     78220.000000
devlopment      100146.666667
marketing        45000.000000
production      255000.000000
Name: Salary, dtype: float64

## 6. How to concatenate two DataFrames?

In [239]:
new_employees={
    "Emp_id":[12,13,14,14,16],
    "Name":['preeti','pramod','sandip','sandip','alex'],
    'Age':[20,22,19,19,23],
    "Location":["nanded",'pune','parbhani','parbhani','latur'],
    "Department_id":[105,102,105,105,104],
    "Department_name":["sales","data science","sales","sales","HR"],
    'Salary':[76000,120000,56000,56000,90000]
}

In [240]:
new_emp_df=pd.DataFrame(new_employees)

In [241]:
new_emp_df

   Emp_id    Name  Age  Location  Department_id Department_name  Salary
0      12  preeti   20    nanded            105           sales   76000
1      13  pramod   22      pune            102    data science  120000
2      14  sandip   19  parbhani            105           sales   56000
3      14  sandip   19  parbhani            105           sales   56000
4      16    alex   23     latur            104              HR   90000

In [242]:
concate_df=pd.concat([emp_df,new_emp_df],ignore_index=True)

In [243]:
concate_df

    Emp_id      Name  Age    Location  Department_id Department_name  Salary
0        1    anisha   21    parbhani            102    data science   52000
1        2    sakshi   20      nanded            104              HR   65600
2        3    poonam   19    parbhani            103      production   95000
3        4     omkar   20        pune            101      devlopment  104440
4        5    ganesh   21  aurangabad            101      devlopment   98000
5        6  samiksha   22      mumbai            103      production   50000
6        7  devanand   19      nashik            105       marketing   45000
7        8    vishnu   18      nanded            103      production  620000
8        9    govind   23    amravati            102    data science  104440
9       10   gayatri   20        beed            101      devlopment   98000
10      11    shamal   19      nanded            104              HR   50000
11      12    preeti   20      nanded            105           sales   76000
12      13    pramod   22        pune            102    data science  120000
13      14    sandip   19    parbhani            105           sales   56000
14      14    sandip   19    parbhani            105           sales   56000
15      16      alex   23       latur            104              HR   90000

## How to merge two DataFrames?

In [244]:
df1_for_merge=concate_df[['Emp_id','Name','Age','Location']]

In [245]:
df1_for_merge.head()

   Emp_id    Name  Age    Location
0       1  anisha   21    parbhani
1       2  sakshi   20      nanded
2       3  poonam   19    parbhani
3       4   omkar   20        pune
4       5  ganesh   21  aurangabad

In [246]:
df2_for_merge=concate_df[["Emp_id",'Department_id','Department_name','Salary']]

In [247]:
df2_for_merge.head()

   Emp_id  Department_id Department_name  Salary
0       1            102    data science   52000
1       2            104              HR   65600
2       3            103      production   95000
3       4            101      devlopment  104440
4       5            101      devlopment   98000

In [248]:
merge_df=df1_for_merge.merge(df2_for_merge,on='Emp_id',how='inner')

In [249]:
merge_df.head()

   Emp_id    Name  Age    Location  Department_id Department_name  Salary
0       1  anisha   21    parbhani            102    data science   52000
1       2  sakshi   20      nanded            104              HR   65600
2       3  poonam   19    parbhani            103      production   95000
3       4   omkar   20        pune            101      devlopment  104440
4       5  ganesh   21  aurangabad            101      devlopment   98000

## 8. How to remove duplicates from a DataFrame?

In [250]:
merge_df.shape

(18, 7)

In [251]:
rmv_duplicates=merge_df.drop_duplicates()

In [252]:
rmv_duplicates.head()

   Emp_id    Name  Age    Location  Department_id Department_name  Salary
0       1  anisha   21    parbhani            102    data science   52000
1       2  sakshi   20      nanded            104              HR   65600
2       3  poonam   19    parbhani            103      production   95000
3       4   omkar   20        pune            101      devlopment  104440
4       5  ganesh   21  aurangabad            101      devlopment   98000

In [253]:
rmv_duplicates.shape

(15, 7)

## 9. How to rename columns in a DataFrame?

In [254]:
rmv_duplicates.columns

Index(['Emp_id', 'Name', 'Age', 'Location', 'Department_id', 'Department_name',
       'Salary'],
      dtype='object')

In [255]:
rename_columns=rmv_duplicates.rename(columns={"Location":'Address','Department_id':'Dept_id',"Department_name":"Dept_name"})

In [256]:
rename_columns.columns

Index(['Emp_id', 'Name', 'Age', 'Address', 'Dept_id', 'Dept_name', 'Salary'], dtype='object')

## 10. How to change the data type of a column?

In [257]:
rename_columns.dtypes

Emp_id        int64
Name         object
Age           int64
Address      object
Dept_id       int64
Dept_name    object
Salary        int64
dtype: object

In [258]:
rename_columns[["Age","Salary"]]=rename_columns[["Age","Salary"]].astype(float)

In [259]:
rename_columns.dtypes

Emp_id         int64
Name          object
Age          float64
Address       object
Dept_id        int64
Dept_name     object
Salary       float64
dtype: object

# Data Analysis







5. How to create a cross-tabulation table?

7. How to perform a rolling window operation?
8. How to perform an expanding window operation?
9. How to calculate the cumulative sum of a column?
10. How to calculate the moving average of a column?

## 1. How to calculate the mean of a column?

In [260]:
avg=rename_columns.groupby("Dept_name")["Salary"].mean()

In [261]:
avg

Dept_name
HR               68533.333333
data science     92146.666667
devlopment      100146.666667
marketing        45000.000000
production      255000.000000
sales            66000.000000
Name: Salary, dtype: float64

## 2. How to calculate the standard deviation of a column?

In [262]:
standard_deviation=rename_columns.groupby("Dept_name")["Salary"].std()

In [263]:
standard_deviation

Dept_name
HR               20160.687819
data science     35627.861756
devlopment        3718.135734
marketing                 NaN
production      316899.037550
sales            14142.135624
Name: Salary, dtype: float64

## 3. How to calculate the correlation between two columns?

In [264]:
corr=rename_columns['Age'].corr(rename_columns["Salary"])

In [265]:
corr

np.float64(-0.3583874475550895)

In [266]:
numeric_df=rename_columns.select_dtypes(exclude=object)
matrix_corr=numeric_df.corr()

In [267]:
matrix_corr

           Emp_id       Age   Dept_id    Salary
Emp_id   1.000000  0.196890  0.361457  0.022615
Age      0.196890  1.000000 -0.314970 -0.358387
Dept_id  0.361457 -0.314970  1.000000 -0.109305
Salary   0.022615 -0.358387 -0.109305  1.000000

 ## 4. How to create a pivot table?

In [268]:
# pivot_table=pd.pivot_table(rename_columns,values="Salary",aggfunc=sum)

## 6. How to perform a groupby operation?

In [269]:
group_by=rename_columns.groupby("Dept_name")["Salary"].agg(func=["count","mean","sum",'min','max'])

In [270]:
group_by

              count           mean       sum      min       max
Dept_name
HR                3   68533.333333  205600.0  50000.0   90000.0
data science      3   92146.666667  276440.0  52000.0  120000.0
devlopment        3  100146.666667  300440.0  98000.0  104440.0
marketing         1   45000.000000   45000.0  45000.0   45000.0
production        3  255000.000000  765000.0  50000.0  620000.0
sales             2   66000.000000  132000.0  56000.0   76000.0

# Data Input/Output

## 1. How to write a DataFrame to a CSV file?

In [279]:
rename_columns.to_csv("Employees_info_2.csv",index=False)
print("Csv File write successfully..!")

Csv File write successfully..!

## How to read a CSV file?

In [283]:
emp_df=pd.read_csv("Employees_info.csv")

In [284]:
emp_df.head()

   Emp_id    Name   Age     Address  Dept_id     Dept_name  Salary
0       1  anisha  21.0    parbhani      102  data science   52000
1       2  sakshi  20.0      nanded      104            HR   65600
2       3  poonam  19.0    parbhani      103    production   95000
3       4   omkar  20.0        pune      101    devlopment  104440
4       5  ganesh  21.0  aurangabad      101    devlopment   98000

## How to write a DataFrame to an Excel file?

In [293]:
#emp_df.to_excel("Employee_Excel.xlsx")

##  How to read an Excel file?

In [297]:
# vote_df=pd.read_excel("Votes 2019.xlsx")

## 5. How to read a JSON file?

In [298]:
# write csv to json
emp_df.to_json("emp.json")

In [299]:
# read json file
df=pd.read_json("emp.json")

In [300]:
df.head()

   Emp_id    Name   Age     Address  Dept_id     Dept_name  Salary
0       1  anisha  21.0    parbhani      102  data science   52000
1       2  sakshi  20.0      nanded      104            HR   65600
2       3  poonam  19.0    parbhani      103    production   95000
3       4   omkar  20.0        pune      101    devlopment  104440
4       5  ganesh  21.0  aurangabad      101    devlopment   98000


Data Cleaning


2. How to detect and remove outliers?

4. How to fill missing values with a specific value?
5. How to replace values in a column?

## 1. How to handle missing values in a DataFrame?

In [301]:
emp_df.isnull().sum()

Emp_id       0
Name         0
Age          3
Address      2
Dept_id      0
Dept_name    0
Salary       0
dtype: int64

## 3. How to remove rows with missing values?

In [302]:
emp_df.shape

(23, 7)

In [304]:
emp_df.dropna(inplace=True)

In [305]:
emp_df.shape

(18, 7)

   Emp_id    Name   Age     Address  Dept_id     Dept_name    Salary
0       1  anisha  21.0    parbhani      102  data science   52000.0
1       2  sakshi  20.0      nanded      104            HR   65600.0
2       3  poonam  19.0    parbhani      103    production   95000.0
3       4   omkar  20.0        pune      101    devlopment  104440.0
4       5  ganesh  21.0  aurangabad      101    devlopment   98000.0